In [1]:
import pandas as pd
import numpy as np

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [103]:
data = pd.read_csv('./data.csv')

In [24]:
data.columns

Index(['id', 'address', 'categories', 'city', 'cuisines', 'dateAdded',
       'dateUpdated', 'latitude', 'longitude', 'menus.category',
       'menus.currency', 'menus.dateSeen', 'menus.description', 'menus.name',
       'name', 'province'],
      dtype='object')

In [45]:
list(data[['city', 'id']].groupby(['city']).count().sort_values(by='id', ascending=False).reset_index().iloc[:5, 0].values)

['San Diego', 'Los Angeles', 'Chicago', 'San Francisco', 'New York']

In [55]:
result = (
    data[data['name'] == 'Taco Bell'][['city', 'name']]
        .groupby('city')
        .agg('count')
        .sort_values(by='name', ascending=False)
        ['name'][0:5]
)

In [59]:
data['dateAdded'] = pd.to_datetime(data['dateAdded'])

In [66]:
data.iloc[0]['dateAdded'].month

3

In [68]:
data[data['dateAdded'].dt.month == 10].index[:5]

Int64Index([2, 21, 22, 23, 24], dtype='int64')

In [70]:
data[['dateAdded', 'id']].groupby('dateAdded').agg('count')

                           id
dateAdded
2014-01-02 03:43:21+00:00   2
2014-01-03 04:58:26+00:00   1
2014-01-03 05:00:06+00:00   3
2014-01-06 05:31:13+00:00   1
2014-01-06 05:39:44+00:00   4
...                        ..
2017-06-29 14:55:38+00:00   1
2017-06-29 14:55:39+00:00   9
2017-06-29 14:55:40+00:00   1
2017-06-29 14:55:41+00:00   2
2017-06-29 14:55:42+00:00   8

[17965 rows x 1 columns]

In [94]:
data.dtypes

id                    object
address               object
categories            object
city                  object
cuisines              object
dateAdded             object
dateUpdated           object
latitude             float64
longitude            float64
menus.category        object
menus.currency        object
menus.dateSeen        object
menus.description     object
menus.name            object
name                  object
province              object
dtype: object

In [99]:
data['update_delta'] = (pd.to_datetime(data['dateUpdated']) - pd.to_datetime(data['dateAdded'])).dt.days
# result = data.groupby('city').agg({'update_delta': 'mean', 'latitude': 'max'}).reset_index()
# zep_mean = result[result['city'] == 'Zephyrhills']['update_delta'].item()
# zep_mean

In [102]:
round(data['update_delta'].median(), 2)

364.0

In [133]:
data = pd.read_csv('./data.csv')
df = data[data['categories'].str.split(',').apply(len) > 20]
result = df.groupby('province')[['longitude']].min()
result['longitude'] = (result['longitude']).apply(lambda x: round(x, 3))
result.to_csv('lesson4_1.csv', sep=';')
result

              longitude
province
AZ             -110.136
CA             -122.417
DC              -77.075
G P O           -73.990
KY              -87.455
MA              -71.055
MD              -77.453
NY              -76.794
St Simons Is    -81.394
TX              -94.939
VA              -77.093
WA             -122.383
WI              -89.377

In [120]:
result

        province  longitude
0             AZ   -110.136
1             CA   -122.417
2             DC    -77.075
3          G P O    -73.990
4             KY    -87.455
5             MA    -71.055
6             MD    -77.453
7             NY    -76.794
8   St Simons Is    -81.394
9             TX    -94.939
10            VA    -77.093
11            WA   -122.383
12            WI    -89.377

In [127]:
len(df.categories[1750].split(','))

22